examples/dfHighSpeedFoam/twoD_detC2H4WaterMist/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs (
      "libEvaporationNew.so"
     );

application     dfHighSpeedFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.2e-04;

deltaT          1e-9;

writeControl    adjustableRunTime;//timeStep;//

writeInterval   1e-06;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.1;

runTimeModifiable true;

maxDeltaT       1;


// ************************************************************************* //
