examples/dfHighSpeedFoam/twoD_detC2H4WaterMist/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=dfHighSpeedFoam

cp -r 0_orig/ 0/
runApplication blockMesh
runApplication setFields
runApplication decomposePar
runApplication mpirun -np 200 --allow-run-as-root $application -parallel

# To convert position file of droplet, use this commend:
#   reconstructPar
#   dfHighSpeedFoam -postProcess -dict system/positionConvertDict